import { SRD_52_SOURCE } from '../../source';
import type { OfficialItemEntry } from '../../types';

export const scrollsMagicItems: OfficialItemEntry[] = [
  {
    "entity": "item",
    "slug": "spell-scroll",
    "nameUk": "Сувій закляття",
    "nameOriginal": "Spell Scroll",
    "status": "official",
    "source": SRD_52_SOURCE,
    "itemType": "сувої",
    "category": "Магічні предмети",
    "subcategory": "Сувої",
    "rarity": "різна",
    "magical": true,
    "attunement": false,
    "weight": "",
    "cost": "",
    "properties": [
      {
        "id": "spell-scroll-property",
        "nameUk": "Магічна властивість",
        "sourceText": "Сувій заклинань містить слова одного заклинання, написані містичним шифром. Якщо заклинання є у вашому списку заклинань, ви можете прочитати сувій і застосувати його заклинання без компонентів Матеріалу. Інакше сувій буде нерозбірливим. Для використання заклинання за допомогою читання сувою потрібен звичайний час застосування заклинання. Після застосування заклинання сувій розсипається на прах. Якщо кастинг переривається, сувій не втрачається.\n\nЯкщо заклинання є у вашому списку заклинань, але має вищий рівень, ніж ви можете використовувати зазвичай, ви виконуєте перевірку здібностей, використовуючи свою здатність заклинання, щоб визначити, чи ви використовуєте заклинання. СК дорівнює 10 плюс рівень заклинання. У разі невдалої перевірки заклинання зникає зі сувою без будь-яких інших ефектів.\n\nРівень заклинання на сувої визначає СК рятувального кидка заклинання та бонус до атаки, а також рідкість сувою, як показано в наступній таблиці.\n\n|Рівень заклинань |Рідкість |Зберегти СК |Бонус за атаку |\n\n|---|---|---|---|\n\n|Замовляння |Загальні |13 |+5 |\n\n|1 |Загальні |13 |+5 |\n\n|2 |Нечасто |13 |+5 |\n\n|3 |Нечасто |15 |+7 |\n\n|4 |Рідкісний |15 |+7 |\n\n|5 |Рідкісний |17 |+9 |\n\n|6 |Дуже рідко |17 |+9 |\n\n|7 |Дуже рідко |18 |+10 |\n\n|8 |Дуже рідко |18 |+10 |\n\n|9 |Легендарний |19 |+11 |\n\nКопіювання сувою в книгу заклинань. Заклинання чарівника на сувої заклинань можна скопіювати в книгу заклинань. Коли заклинання скопійовано таким чином, копіювальний апарат має успішно пройти перевірку Інтелекту (Аркана) із СК, що дорівнює 10 плюс рівень заклинання. Після успішної перевірки заклинання копіюється. Незалежно від того, вдалася перевірка чи не вдалася, сувій заклинань знищується."
      }
    ],
    "consumable": true
  }
];
